// Напишите программу, которая принимает на вход координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка.

System.Console.WriteLine("Введите первую кординату");
int x = System.Console.ReadLine();
System.Console.WriteLine("Введите вторую кординату");
int Y = System.Console.ReadLine();


